csn = ('Быкова', 'Глухов', 'Касырев', 'Середин', 'Леонов', 'Светухин', 'Букач', 'Гаршин', 'Попов',
       'Довогополый', 'Петухов', 'Дорошенко', 'Жуков', 'Ерусалимский', 'Баранов', 'Вознесенский',
       'Буканов', 'Чумичëва', 'Лизунова', 'Яхонтова', 'Крусер', 'Василевский')

cb_opera_tuple = ('Аида', 'Волшебная флейта', 'Иоланта (Жолдак)', 'Манон Леско', 'Опричник',
            'Пиковая дама','Севильский Цирюльник', 'Сельская честь', 'Тоска', 'Травиата',
            'Фигаро', 'Золушка', 'Иоланта','Летучий Голландец', 'Закрыть')

cb_balet_tuple = ('Баядерка', 'Дон Кихот', 'Дуато', 'Жизель', 'Золушка', 'Конек Горбунок', 'Коппелия', 'Корсар',
            'Лауренсия', 'Лебединое Озеро', 'Пламя парижа', 'Ромео И Дж', 'Сильфида', 'Спартак',
            'Спящая Красавица', 'Тщетная предосторожность', 'Чиполлино', 'Щелкунчик', 'балеты Васильева', 'Закрыть')

day_number = ('1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19',
              '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31')

month = ('Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль',
         'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь', 'За все отработанное время')

time_fsf_filter = ('за 1 час', 'за 2 часа', 'за 3 часа', 'за 4 часа')

user_post = {'Василевский': 'Начальник осветительской службы',
             'Круссер': 'Ведущий инженер',
             'Глухов': 'Начальник смены',
             'Быкова': 'Начальник смены',
             'Касырев': 'Инженер',
             'Середин': 'Инженер',
             'Леонов': 'Инженер',
             'Светухин': 'Техник',
             'Букач': 'Техник',
             'Гаршин': 'Осветитель',
             'Попов': 'Осветитель',
             'Довгополый': 'Осветитель',
             'Петухов': 'Осветитель',
             'Дорошенко': 'Осветитель',
             'Жуков': 'Осветитель',
             'Ерусалимский': 'Осветитель',
             'Баранов': 'Осветитель',
             'Вознесенский': 'Осветитель',
             'Буканов': 'Осветитель',
             'Лизунова': 'Светооператор',
             'Яхонтова': 'Светооператор',
             'Чумичёва': 'Светооператор'}