csn = ('Быкова', 'Глухов', 'Касырев', 'Середин', 'Леонов', 'Светухин', 'Букач', 'Гаршин', 'Попов',
       'Довгополый', 'Петухов', 'Дорошенко', 'Жуков', 'Ерусалимский', 'Вознесенский',
       'Буканов', 'Мосеев', 'Чумичëва', 'Лизунова', 'Яхонтова', 'Крусcер', 'Василевский')


day_number = ('1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19',
              '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31')

month = ('Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль',
         'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь', 'За все отработанное время')

time_fsf_filter = ('за 1 час', 'за 2 часа', 'за 3 часа', 'за 4 часа')

genre_show_f: dict = {'Опера': ('Аида', 'Волшебная флейта', 'Иоланта (Жолдак)', 'Манон Леско', 'Опричник',
                                'Пиковая дама', 'Севильский Цирюльник', 'Сельская честь', 'Тоска', 'Травиата',
                                'Фигаро', 'Золушка', 'Иоланта', 'Летучий Голландец'),
                      'Балет': ('Баядерка', 'Дон Кихот', 'Дуато', 'Жизель', 'Золушка', 'Конек-Горбунок', 'Коппелия',
                                'Корсар', 'Лауренсия', 'Лебединое Озеро', 'Пламя парижа', 'Ромео И Дж', 'Сильфида',
                                'Спартак', 'Спящая Красавица', 'Тщетная предосторожность', 'Чиполлино', 'Щелкунчик',
                                'балеты Васильева')}

how_mutch_delete_fltr = ('1 DEL', '2 DEL', '3 DEL', '4 DEL', '5 DEL', '6 DEL', '7 DEL', '8 DEL', '9 DEL', '10 DEL',
                         '11 DEL', '12 DEL', '13 DEL', '14 DEL', '15 DEL', '16 DEL', '17 DEL', '18 DEL', '19DEL',
                         '20 DEL')

how_mutch_delete_file_fltr = ('1 DELF', '2 DELF', '3 DELF', '4 DELF', '5 DELF', '6 DELF', '7 DELF', '8 DELF', '9 DELF',
                              '10 DELF')